<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,300,300" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Range_1296" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="0" size="12"/>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_1297" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="12" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1297"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_1298" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Gather_1298, Range_1296"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_2799" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Divide_1300" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1299, Divide_1300"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_2818" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="20" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Subtract_2821" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="331"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_2812" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="32" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_2822" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="331"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_2815" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="44" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="331" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="331"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="331">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="backbone.features.0.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="56" size="2592"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.0.0.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.0.0.weight">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="332" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="332"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="332">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_2841" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2648" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Subtract_2844" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="333"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_2835" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2744" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_2845" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="333"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_2838" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2840" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="333" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="333"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="333">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="334" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="334"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="334">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_344" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="2936" size="864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="335" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="335, Reshape_344"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="335">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_2864" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3800" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Subtract_2867" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="336"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_2858" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3896" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Multiply_2868" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="336"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_2861" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3992" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="336" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="336"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="336">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="337" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="337"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="337">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="backbone.features.1.conv.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="12, 24, 1, 1" offset="4088" size="1152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.1.conv.3.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.1.conv.3.weight">
					<dim>12</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="338" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="338"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="338">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_2887" type="Const" version="opset1">
			<data element_type="f32" shape="1, 12, 1, 1" offset="5240" size="48"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Subtract_2890" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="339"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_2881" type="Const" version="opset1">
			<data element_type="f32" shape="1, 12, 1, 1" offset="5288" size="48"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Multiply_2891" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="339"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_2884" type="Const" version="opset1">
			<data element_type="f32" shape="1, 12, 1, 1" offset="5336" size="48"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="339" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="339"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="339">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="backbone.features.2.conv.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="72, 12, 1, 1" offset="5384" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.2.conv.0.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.2.conv.0.weight">
					<dim>72</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="340" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="340"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="340">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_2910" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="8840" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Subtract_2913" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="341"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_2904" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="9128" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_2914" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="341"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_2907" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="9416" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="341" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="341"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="341">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="342" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="342"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="342">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_386" type="Const" version="opset1">
			<data element_type="f32" shape="72, 1, 1, 3, 3" offset="9704" size="2592"/>
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="343" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="343, Reshape_386"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="343">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_2933" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="12296" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Subtract_2936" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="344"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_2927" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="12584" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Multiply_2937" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="344"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_2930" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="12872" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="344" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="344"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="344">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="345" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="345"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="345">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="backbone.features.2.conv.6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="18, 72, 1, 1" offset="13160" size="5184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.2.conv.6.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.2.conv.6.weight">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="346" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="346"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="346">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_2956" type="Const" version="opset1">
			<data element_type="f32" shape="1, 18, 1, 1" offset="18344" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Subtract_2959" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="347"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_2950" type="Const" version="opset1">
			<data element_type="f32" shape="1, 18, 1, 1" offset="18416" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_2960" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="347"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_2953" type="Const" version="opset1">
			<data element_type="f32" shape="1, 18, 1, 1" offset="18488" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="347" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="347"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="347">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="backbone.features.3.conv.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="108, 18, 1, 1" offset="18560" size="7776"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.3.conv.0.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.3.conv.0.weight">
					<dim>108</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="348" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="348"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>108</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="348">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_2979" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="26336" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Subtract_2982" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="349"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_2973" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="26768" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_2983" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="349"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_2976" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="27200" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="349" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="349"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="349">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="350" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="350"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="350">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_428" type="Const" version="opset1">
			<data element_type="f32" shape="108, 1, 1, 3, 3" offset="27632" size="3888"/>
			<output>
				<port id="0" precision="FP32">
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="351" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="351, Reshape_428"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="351">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_3002" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="31520" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Subtract_3005" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="352"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_2996" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="31952" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_3006" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="352"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_2999" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="32384" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="352" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="352"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="352">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="353" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="353"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="353">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="backbone.features.3.conv.6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="18, 108, 1, 1" offset="32816" size="7776"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.3.conv.6.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.3.conv.6.weight">
					<dim>18</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="354" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="354"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>18</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="354">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_3025" type="Const" version="opset1">
			<data element_type="f32" shape="1, 18, 1, 1" offset="40592" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Subtract_3028" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="355"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_3019" type="Const" version="opset1">
			<data element_type="f32" shape="1, 18, 1, 1" offset="40664" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Multiply_3029" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="355"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_3022" type="Const" version="opset1">
			<data element_type="f32" shape="1, 18, 1, 1" offset="40736" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="355" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="355"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="356" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="356"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="356">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="backbone.features.4.conv.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="108, 18, 1, 1" offset="40808" size="7776"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="backbone.features.4.conv.0.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="backbone.features.4.conv.0.weight">
					<dim>108</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="357" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="357"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>108</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="357">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_3048" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="48584" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Subtract_3051" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="358"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_3042" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="49016" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Multiply_3052" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="358"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_3045" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="49448" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="358" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="358"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="358">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="359" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="359"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="359">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_471" type="Const" version="opset1">
			<data element_type="f32" shape="108, 1, 1, 3, 3" offset="49880" size="3888"/>
			<output>
				<port id="0" precision="FP32">
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="360" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="360, Reshape_471"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="360">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Reshape_3071" type="Const" version="opset1">
			<data element_type="f32" shape="1, 108, 1, 1" offset="53768" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Subtract_3074" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="361"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
